* Tasks
** DONE Bloquear dias interiores ao dia atual no calendario de vencimento app vendedor :cdc:
CLOSED: <2021-06-07 Mon 10:02> DEADLINE: <2021-06-07 Mon 05:00>
  Exemplo:
  #+BEGIN_QUOTE
  Se hoje eh dia 17, os dias 1 a 16 vao ficar bloqueados para clique.
  #+END_QUOTE
** DONE subir isso para master e avisar o mendes                  :conductor:
CLOSED: <2021-06-07 Mon 11:54> SCHEDULED: <2021-06-07 Mon 13:00>
[[file:~/Documents/projects/conductor-backend/src/ormconfig.ts::password: process.env.DATABASE_PASSWORD,]]
** DONE Conversar com augusto sobre subir apenas o update de senha por enquanto no app cliente :cdc:
CLOSED: <2021-06-07 Mon 11:54> SCHEDULED: <2021-06-07 Mon 12:00>
Para isso vou precisar tirar a visualizacao da data de vencimento do app cliente(apenas comenta as linhas)
** DONE Validar com mendes o prazo de frontend para conductor     :conductor:
CLOSED: <2021-06-09 Wed 09:40> SCHEDULED: <2021-06-08 Tue 09:30>
[[https://hagens.invisionapp.com/overview/Conductor---Acesso---Desk-ckookkbrq0492013rgqop0vrn/screens?sortBy=1&sortOrder=1&viewLayout=2]]
** DONE Adaptar app cliente para atualizar apenas o fluxo de esqueci minha senha :cdc:
CLOSED: <2021-06-07 Mon 14:15> SCHEDULED: <2021-06-07 Mon 14:00>
Para isso vou precisar tirar a visualizacao da data de vencimento do app cliente(apenas comenta as linhas)
** DONE Alinhar layout para novo cliente(primetek)                      :cdc:
- [ ] Parametrizar logos e cores do app CDC em um objeto compartilhado
CLOSED: [2021-06-16 Wed 09:06]
** DONE Discutir com leo e mendes                                       :cdc:

1. Avaliar uso do Webhook para atualizar situacao da home em tempo real
Pois via certa nao envia SMS quando proposta eh pendenciada
2. No envio dos documentos, oferecer ao cliente a possibilidade de escolher uma
foto do documento na galeria
CLOSED: [2021-06-15 Tue 11:04]
:LOGBOOK:
CLOCK: [2021-06-14 Mon 19:36]--[2021-06-14 Mon 19:37] => 00:01
:END:
** DONE Incluir mudanças de layout sugeridas pelo leo
Padronizar todas as inputs do app com o mesmo height e com o placeholder dentro da input(ao inves de em cima)
CLOSED: [2021-06-16 Wed 13:26]
:LOGBOOK:
CLOCK: [2021-06-16 Wed 09:08]--[2021-06-16 Wed 09:10] => 00:02
:END:
** DONE Preparar um invision com todas as telas do novo layout de primetek
CLOSED: [2021-06-21 Mon 08:35]
:LOGBOOK:
CLOCK: [2021-06-16 Wed 09:10]--[2021-06-16 Wed 09:10] => 00:00
:END:
** DONE Corrigir layout app cdc                                         :cdc:
1. No fundo de SOL, optar pelo degrade de fundo(background-image: linear-gradient(#e83f32, #9c1e2d, #52000a) !important;)
2. Em SOL, trocar a cor dos botoes para preto(criar uma variavel em theme chamada buttonColor para ficar legal)
CLOSED: [2021-06-16 Wed 14:17]
:LOGBOOK:
CLOCK: [2021-06-16 Wed 13:26]--[2021-06-16 Wed 13:28] => 00:02
:END:
** DONE Fazer reuniao com conductor para testar se o login esta funcionando ao readme.io :conductor:
CLOSED: [2021-06-17 Thu 16:13]
:LOGBOOK:
CLOCK: [2021-06-16 Wed 14:17]--[2021-06-16 Wed 14:17] => 00:00
:END:
** DONE todos para conductor dashboard
- [X] No ultimo login, trocar pierpro e pierflex por PierPro e PierFlex
- [X] Diminuir um pouco o font-size no footer
- [X] Centralizar a paginação
CLOSED: [2021-06-18 Fri 15:35]
:LOGBOOK:
CLOCK: [2021-06-18 Fri 14:55]--[2021-06-18 Fri 14:56] => 00:01
:END:
** DONE Fluxo para atualizar status da proposta                         :cdc:
   CLOSED: [2021-06-24 qui 10:01] DEADLINE: <2021-06-23 Wed 12:00>
 :LOGBOOK:
 CLOCK: [2021-06-21 Mon 16:09]--[2021-06-21 Mon 16:19] => 00:10
 :END:
 1. Permitir que usuario so possa atualizar o status a cada X minutos(prover um auxilio via mensagens)
 2. Permitir um numero fixo de vezes para o usuario atualizar o status
** DONE Terminar layout da tela login                                   :btr:
   CLOSED: [2021-06-24 qui 10:01] DEADLINE: <2021-06-23 Wed 18:00>
** DONE Perguntar para o guilherme sobre o CRM usado em Gente&Gente para reutilizar em btr varese
   CLOSED: [2021-06-28 seg 11:08] DEADLINE: <2021-06-28 seg 13:00>
** DONE Adicionar no cadastro de BTR
   CLOSED: [2021-06-25 sex 11:02] DEADLINE: <2021-06-23 Wed 16:00>
 campo cargo - uma lista
 com cargos acima de gerente(pesquisar)
 tela entre dados de assistente e passaporte
 title: produto btr varese
 Escolha qual pacote deseja contratar:
 campos(checkbox):
 - NRF
 - China
 - Israel
** DONE Integrar RD Station ao cadastro de btr
   CLOSED: [2021-06-24 qui 15:46] DEADLINE: <2021-06-23 Wed 16:00>
 Adicionar uma tela anterior ao primeiro passo:
 "Voce ja viajou conosco? informe algum desses dados"
 - Email
 - Telefone
 - CPF
 Apos isso, procurar o maximo de dados do usuario no RD Station e preencher o formulario e permitir que o usuario siga normalmente
** DONE Implementar refresh de token ao inves de ficar utilizando o codigo
   CLOSED: [2021-06-28 seg 09:17] DEADLINE: <2021-06-28 seg 09:00>
   https://developers.rdstation.com/pt-BR/authentication
   Atualizando um token expirado
** DONE Implement this package for workflow
   CLOSED: [2021-06-26 sáb 15:21] DEADLINE: <2021-06-26 sáb 18:00>
   [[file:~/dotfiles/emacs.d/.emacs.d/init.el::(condition-case nil]]
   https://github.com/bbatsov/crux
** DONE Decidir arquitetura para aplicar no boilerplate de backend     :lami:
   CLOSED: [2021-06-29 ter 21:06]
   [2021-06-28 seg]
** DONE Bloquear toda documentacao do pierflex e testar login via dashboard :conductor:
   CLOSED: [2021-06-29 ter 13:20] DEADLINE: <2021-06-29 ter 15:00>

   Entrar em *Internal Documentation* e selecionar para project wide https://docs.readme.com/docs/internal-documentation
** DONE Transformar a rota de INSERT de usuario em um UPSERT(se ja existir, fazer o update) :btr:
   [2021-06-28 seg] 
   CLOSED: [2021-07-02 18:00]
** DONE Checar com augusto estado dos testes para fazermos o update de prod :cdc:
   CLOSED: [2021-06-30 qua 11:52] DEADLINE: <2021-06-30 qua 10:00>
** DONE Terminar pagina home e perfil de btr varese area vip            :btr:
   CLOSED: [2021-06-30 qua 17:09] DEADLINE: <2021-06-30 qua 18:00>
** DONE Discutir com mendes sobre block de puxar dados do wordpress em btr varese area vip :btr:
   CLOSED: [2021-06-30 qua 17:09] DEADLINE: <2021-06-30 qua 15:00>
** DONE Testar junto com mendes acesso ao conductor pierflex e pierpro :conductor:
   CLOSED: [2021-06-30 qua 17:09] DEADLINE: <2021-06-30 qua 15:00>
** DONE Atualizar horario de conductor no card q a nath marcou    :conductor:
   CLOSED: [2021-06-30 qua 13:21] DEADLINE: <2021-06-30 qua 13:30>
   https://hagens.monday.com/boards/1100382295/pulses/1437879007
** DONE Discutir com ivan se ele sabe expor wordpress via api rest      :btr:
   DEADLINE: <2021-07-01 qui 09:00>
** DONE Terminar funcionalidade de enviar usuario to formularios especificos :btr:
** DONE Aceitar apenas numeros no campo "Numero da Casa" no confirmar-dados :cdc:
   CLOSED: [2021-07-05 seg 18:05] SCHEDULED: <2021-07-05 seg 18:00>
** DONE Testes - Hagens / Conductor                               :conductor:
   CLOSED: [2021-07-06 ter 20:03] SCHEDULED: <2021-07-06 ter 16:45>
   https://teams.microsoft.com/l/meetup-join/19%3ameeting_ZTJjY2RjZDItNmM1ZC00ODNkLWIyZGYtMTZkZmVmNDI5ZGUz%40thread.v2/0?context=%7b%22Tid%22%3a%2262d496c8-b01f-46bf-9659-e70e545c638d%22%2c%22Oid%22%3a%22b5d3f1ad-9791-4b85-b216-ae04242a1094%22%7d
** DONE CDC <> app confirmação vendas                                   :cdc:
   CLOSED: [2021-07-06 ter 11:30] SCHEDULED: <2021-07-06 ter 11:00>
   https://meet.google.com/kbo-zvxn-ecs
   - Tela de Login
     - Login(Acredito que seja um codigo de acesso como no app vendedor)
     - Senha
   - Consultar compra do cliente
     - Possibilidade de listar as compras do dia atual e de pesquisar usando numero do cartao(Demonstrar em tela o numero de autorizacao)
   - Efetivar compra
     - Exige a senha do cartao(o resto o sistema busca por tras)
   - Cancelar compra apos efetivacao(buscamos tudo por tras), definir comercialmente quanto tempo o usuario eh permitido cancelar
   - Imprimir boleto (???)
     
** DONE Api Boilerplate                                                :lami:
   CLOSED: [2021-07-06 ter 20:03] SCHEDULED: <2021-07-06 ter 18:00>
   https://meet.google.com/jno-nufb-yzw
** DONE Configurar REST Api GET do wordpress                            :btr:
  CLOSED: [2021-07-07 qua 14:13] SCHEDULED: <2021-07-07 qua 13:00>
  References:
  https://developer.wordpress.org/rest-api/
  Example: http://hagens.com.br/wp-json/wp/v2/posts/
** DONE Ajustes                                                   :conductor:
   CLOSED: [2021-07-07 qua 14:13] SCHEDULED: <2021-07-07 qua 14:00>
   https://mail.google.com/mail/u/0/#inbox/FMfcgzGkZGlCmGKPXXNvgRMvnNzqnVjr

   - DONE Melhorar mensagens de erro
   - DONE Incluir Recaptcha no login
   - DONE Incluir botao de cancelar que manda para /login em /cadastro
   - DONE Filtro aparece quando nega ou aprova
   - No filtro de pierflex ou pierpro
      - Direcionar para a aba que contem o lead/leads pesquisado
   - DONE Consertar pierflex para PierFlex em filtro
   - DONE Ajustar campo de email(borda passou)
   - DONE Listar logs do ultimo para o primeiro
** DONE Fazer mais testes no conductor pierflex
   CLOSED: [2021-07-08 qui 08:56] SCHEDULED: <2021-07-08 qui 12:00>

   Em alguns momentos a listagem de card fica em branco, checar esse caso e resolver
